the	237372
,	146158
of	121685
.	89025
in	87539
?	86991
and	77774
to	67479
what	51842
a	51623
is	36599
was	35813
as	25464
for	24027
's	21863
by	20896
that	20242
)	20124
(	20106
with	19668
on	18705
did	17009
are	16285
from	15837
which	15256
``	13483
''	13405
were	13362
who	12553
at	10834
it	10575
an	10370
be	10283
or	10025
how	9966
when	9582
many	8912
have	8651
has	7685
his	7409
this	7396
first	7043
their	7034
not	7000
its	6647
other	6407
also	6264
had	6152
new	6048
city	5959
one	5824
most	5807
where	5511
;	5173
does	5079
during	5076
used	5046
he	4992
year	4916
after	4913
been	4849
but	4848
can	4836
they	4751
more	4675
some	4600
such	4573
into	4276
two	4258
do	4034
all	3959
between	3897
world	3869
than	3795
people	3782
name	3759
time	3752
state	3700
there	3670
states	3519
war	3479
century	3391
%	3360
:	3351
these	3328
over	3283
would	3218
use	3211
only	3174
may	3161
about	3135
united	3058
known	3011
called	2977
government	2799
system	2757
years	2699
'	2696
part	2611
population	2566
made	2562
under	2546
while	2526
type	2450
much	2422
early	2370
up	2309
country	2286
being	2259
american	2251
became	2241
both	2223
area	2196
university	2193
through	2127
often	2119
including	2115
north	2112
since	2103
national	2096
number	2090
group	2084
period	2066
music	2061
]	2059
[	2056
however	2044
power	2037
major	2027
language	2015
british	2011
no	2003
out	1962
later	1945
three	1898
school	1876
well	1857
against	1848
could	1823
south	1805
found	1783
them	1777
her	1776
empire	1756
west	1756
law	1751
large	1744
located	1738
public	1733
largest	1727
church	1717
form	1707
french	1706
second	1705
work	1701
high	1697
if	1689
term	1688
each	1679
before	1664
us	1651
along	1650
several	1645
john	1639
because	1630
led	1623
any	1608
according	1605
million	1603
political	1601
another	1597
end	1592
will	1579
east	1558
countries	1537
become	1534
company	1529
until	1527
military	1524
considered	1518
long	1515
modern	1515
around	1510
international	1504
among	1491
although	1486
within	1485
common	1467
english	1444
different	1443
great	1440
same	1437
those	1435
began	1434
include	1433
general	1433
example	1429
army	1429
european	1429
u.s.	1423
president	1416
place	1394
why	1372
then	1365
like	1361
species	1361
important	1345
based	1342
development	1336
europe	1333
greek	1315
chinese	1314
areas	1313
so	1312
roman	1308
control	1304
due	1300
german	1294
times	1292
region	1291
established	1270
human	1266
home	1259
china	1257
day	1255
island	1255
now	1253
season	1253
france	1246
i	1244
groups	1243
court	1236
order	1236
western	1233
house	1232
air	1231
party	1227
london	1224
make	1220
league	1219
still	1218
main	1203
de	1203
energy	1196
even	1191
members	1188
$	1171
needed	1167
central	1166
held	1165
york	1165
forces	1163
life	1162
union	1158
take	1152
water	1151
created	1147
history	1144
following	1132
late	1130
developed	1128
support	1122
king	1111
india	1108
last	1104
center	1102
four	1101
death	1098
own	1092
social	1088
local	1073
using	1071
usually	1066
education	1059
popular	1040
film	1039
service	1029
built	1028
act	1024
very	1021
him	1021
small	1020
federal	1020
force	1020
study	1018
schools	1016
religious	1013
old	1006
age	999
kind	999
team	994
process	993
land	992
per	982
college	973
set	969
culture	968
middle	967
england	967
light	964
she	955
britain	954
battle	952
kingdom	945
eastern	945
capital	941
river	940
building	939
given	938
book	937
released	934
said	931
–	925
result	925
soviet	925
queen	922
without	921
rule	919
research	919
art	919
2010	918
students	916
official	915
less	914
took	908
various	901
back	900
northern	897
percentage	897
america	895
standard	895
family	888
children	883
economic	879
original	879
way	879
word	877
included	877
body	875
languages	875
royal	874
council	873
ii	868
average	867
god	865
cities	865
though	863
game	862
republic	860
southern	856
came	856
founded	853
black	853
systems	852
germany	850
street	843
treaty	841
similar	838
begin	837
live	836
football	835
1	834
former	830
near	830
single	828
line	825
produced	821
total	815
show	814
third	813
change	811
white	810
generally	805
others	803
paris	802
formed	802
sometimes	798
theory	792
women	791
terms	790
citation	790
caused	787
rights	787
role	785
named	784
should	784
date	782
current	780
majority	778
park	775
higher	773
published	773
percent	772
five	771
science	770
2009	768
red	767
down	764
today	763
parts	762
significant	759
2008	758
must	758
record	755
russian	754
games	754
islands	753
influence	752
throughout	752
movement	748
production	746
bc	745
rate	743
addition	742
natural	741
every	738
era	736
2013	736
march	735
further	732
emperor	732
few	731
top	731
traditional	730
society	730
september	729
2007	728
point	727
play	726
whose	726
wrote	724
sea	724
highest	723
trade	720
free	719
2011	718
especially	718
see	718
played	718
religion	716
won	714
men	714
field	713
ancient	710
community	709
jews	707
2	707
available	705
series	700
having	698
june	698
data	697
july	696
start	696
continued	696
office	695
organization	694
cultural	693
greece	693
january	693
days	692
written	692
club	691
civil	691
chopin	690
level	690
japanese	688
best	688
nations	688
case	685
forms	684
range	684
style	683
growth	682
works	681
increased	680
africa	678
allowed	675
primary	674
african	672
event	672
2012	670
cause	669
rather	667
industry	665
increase	665
provide	665
napoleon	663
position	663
thought	662
foreign	661
nasser	658
october	658
introduced	658
food	654
japan	653
person	653
2014	653
dynasty	653
market	651
leader	651
19th	648
ottoman	647
left	645
information	644
technology	644
records	643
album	643
financial	641
10	641
3	640
spanish	639
come	638
plants	637
business	634
program	632
associated	631
across	631
constitution	631
victoria	631
typically	630
upon	630
itself	628
department	628
services	627
particularly	627
received	627
jewish	627
far	626
low	626
haven	625
color	625
station	624
title	624
israel	622
effect	618
health	618
private	617
dutch	617
mexico	617
media	616
catholic	615
changes	615
instead	614
model	614
brought	613
thus	613
indian	611
present	609
oklahoma	608
help	607
december	607
whom	606
space	606
economy	604
architecture	603
get	602
policy	602
20th	602
airport	601
seen	600
themselves	600
off	599
minister	599
beginning	597
types	596
required	595
april	593
started	591
district	591
open	591
video	590
lower	589
christian	587
latin	587
rock	586
2006	585
rome	585
egypt	584
television	584
able	584
&	583
november	583
county	582
radio	582
museum	581
making	581
outside	579
action	579
referred	579
territory	579
police	576
independent	576
august	575
san	574
possible	574
class	573
revolution	573
famous	572
studies	572
either	571
designed	571
network	570
design	570
town	566
events	566
side	565
final	565
status	564
uk	564
universities	564
once	563
green	562
aircraft	561
song	561
you	560
we	560
independence	560
certain	560
just	560
native	559
view	557
almost	556
troops	555
greater	555
companies	553
george	553
child	550
birds	548
buildings	548
computer	548
st.	547
half	547
followed	544
bell	543
scientific	543
square	541
philosophy	541
laws	541
living	540
construction	540
member	540
legal	538
saw	537
believe	536
asia	534
nation	533
provided	532
boston	531
described	530
announced	529
least	528
windows	527
commonly	526
source	525
next	523
2015	523
leading	523
together	522
means	522
recent	521
attack	519
n't	519
20	519
solar	519
plant	518
cases	516
regions	516
centuries	516
election	515
related	514
run	513
classical	513
lost	513
madonna	513
despite	512
right	511
canada	510
division	510
powers	509
eisenhower	508
replaced	508
amount	507
prior	506
originally	506
special	505
idol	504
produce	504
race	504
sexual	503
australia	503
imperial	503
2005	503
individual	503
head	503
create	502
release	501
believed	500
might	499
father	498
commercial	498
billion	497
responsible	497
remained	497
particular	496
eventually	495
occur	495
size	494
report	494
8	494
money	492
involved	491
sound	489
gave	487
elected	487
lead	487
above	487
von	486
includes	485
supreme	485
evidence	483
taken	483
february	482
animals	482
six	481
structure	480
approximately	480
americans	479
little	479
again	477
sent	477
institute	476
notable	476
5	475
material	474
washington	474
mary	474
association	473
character	473
teams	473
words	472
temperature	472
port	472
prime	472
widely	470
passed	468
mostly	468
died	468
close	466
william	466
apple	464
authority	464
site	464
meaning	464
historical	463
larger	462
working	462
give	461
reported	461
primarily	461
go	460
ireland	459
estimated	459
moved	458
operations	458
churches	457
good	457
limited	457
russia	457
cup	457
summer	457
influenced	456
paper	456
medical	455
specific	455
concept	455
base	455
15	455
scholars	455
parliament	455
agreement	454
annual	454
uses	454
killed	453
strong	452
southampton	452
characters	451
earth	451
nature	449
kerry	449
relationship	449
practice	448
version	448
centre	448
climate	448
security	447
islamic	447
method	447
sun	447
census	447
plymouth	446
mass	446
elements	445
paul	445
opened	445
added	445
gaddafi	445
regional	445
italy	444
feature	444
return	444
carolina	444
say	443
plan	441
man	441
full	441
congress	440
need	440
adopted	440
served	438
mother	437
italian	437
100	436
helped	436
fall	435
software	433
successful	433
rise	432
urban	432
code	431
pope	431
oil	431
saint	431
born	431
dogs	431
beyoncé	430
universal	430
wood	429
mean	429
grand	428
separate	427
lines	427
institutions	427
never	427
earliest	426
hold	425
away	425
detroit	424
knowledge	424
supported	422
melbourne	422
examples	421
bacteria	421
reached	421
call	420
25	420
portugal	420
levels	420
ethnic	419
administration	419
active	417
earlier	416
put	416
conflict	416
reason	415
12	415
oldest	414
declared	414
atlantic	413
compared	413
tibet	413
copper	413
spread	412
sold	412
tradition	412
nearly	412
move	411
son	411
yale	411
experience	410
issue	410
sports	410
schwarzenegger	410
complex	409
houston	409
charles	409
forced	408
electric	408
response	408
stations	408
variety	407
currently	407
features	407
humans	407
project	406
global	406
literature	406
longer	406
discovered	405
subject	405
parties	404
numbers	404
months	404
artists	403
young	403
physical	403
canadian	402
allow	402
largely	402
contemporary	402
short	402
labour	401
past	401
win	400
defined	400
ages	400
find	399
internet	399
arts	398
brain	398
dell	398
province	398
problems	398
recorded	398
divided	398
signed	397
towards	397
30	397
likely	397
went	396
whether	396
success	396
festival	395
minority	395
store	394
digital	393
palace	393
smaller	393
value	392
2000	392
james	392
spain	392
hall	392
4	392
receive	392
chief	391
exist	391
directly	391
muslim	391
month	389
players	389
road	388
interest	388
board	388
ranked	387
la	387
occurred	386
mainly	386
access	385
communities	385
governor	385
han	385
direct	384
2004	384
remains	384
switzerland	384
future	384
personal	384
previous	384
°c	383
cost	383
stated	383
focus	382
changed	382
initially	381
arab	381
indigenous	380
mountains	380
cotton	380
iran	380
portuguese	379
crisis	379
...	379
residents	379
delhi	378
format	378
officially	378
border	377
ad	377
too	377
quality	377
seven	377
serve	376
idea	376
products	376
names	375
coast	375
origin	375
activity	374
industrial	373
kanye	373
ground	373
antenna	373
library	372
campus	372
better	371
bank	371
devices	371
band	370
programs	370
spoken	370
mi	370
resulted	370
ended	369
stand	369
describe	369
peace	368
location	367
himself	367
previously	367
launched	367
writing	367
training	367
always	366
estonia	366
executive	366
korea	366
glass	365
identity	365
campaign	365
invasion	365
miles	364
orthodox	364
rest	362
nanjing	362
appear	361
ideas	360
downtown	360
zinc	360
11	360
performance	359
dame	358
numerous	358
turn	357
defence	357
km	357
bronx	356
henry	356
foundation	355
remain	354
fire	354
basic	354
list	353
entire	353
seattle	353
night	352
female	352
makes	352
worldwide	352
lived	351
ability	351
beer	351
purpose	351
problem	350
individuals	350
conditions	350
jesus	350
granted	350
matter	350
proposed	349
relations	349
competition	349
decade	349
speed	348
°f	347
miami	347
citizens	347
darwin	347
definition	346
m	346
soldiers	346
attempt	345
professional	345
highly	345
property	344
sources	344
besides	343
therefore	343
premier	343
daily	343
die	343
notre	343
share	342
lack	342
offer	341
6	341
houses	341
insects	340
blue	340
loss	340
prince	340
iii	340
text	339
via	339
diego	338
vote	338
buddhism	338
news	338
hours	337
ever	337
armenia	337
torch	337
operation	337
populations	337
families	337
student	336
decline	336
domestic	335
memory	335
territories	335
fact	335
happened	335
tennessee	334
hayek	334
animal	333
7	333
pain	333
ten	333
provides	332
command	332
claim	332
whitehead	331
becoming	331
refer	331
audio	331
contains	331
richmond	331
18	331
valley	330
claimed	330
burke	330
defeated	330
medieval	330
dialects	329
develop	329
avenue	329
florida	328
ruled	328
assembly	327
prominent	327
host	327
relatively	327
soon	327
mountain	327
below	327
leaders	327
potential	327
stadium	326
armenian	326
18th	326
wars	326
rules	326
issues	325
usb	325
argued	325
degree	324
section	324
gas	324
metropolitan	324
test	323
appointed	323
heavy	323
hunting	323
2003	322
cells	322
starting	322
films	322
applied	322
true	322
dna	322
units	321
content	321
16	320
front	320
behind	320
presence	320
decided	319
committee	319
rank	319
basis	318
increasing	318
real	318
finally	317
hydrogen	317
award	317
dialect	317
disease	317
metal	317
contain	316
deal	316
done	316
product	316
expansion	315
big	315
performed	315
hit	315
genetic	314
songs	314
winter	314
attacks	314
elizabeth	313
reach	313
activities	313
tito	313
prussia	312
gain	312
ming	312
branch	312
prevent	311
goal	311
barcelona	310
thomas	310
beyonce	310
reduced	310
sales	310
placed	309
creation	309
tuvalu	309
magazine	309
multiple	308
methods	308
pacific	308
key	308
allows	307
hard	307
resulting	307
direction	306
books	306
device	306
things	305
additional	305
surface	305
already	305
uranium	305
ipod	305
difficult	304
continue	304
movie	303
bill	303
officials	303
sense	303
differences	302
operating	302
musical	301
letter	301
cultures	301
destroyed	301
income	300
else	300
growing	300
tibetan	299
peoples	299
neumann	299
nuclear	298
marked	298
hyderabad	298
ocean	298
results	298
14	297
pay	297
wide	297
noted	296
visit	296
derived	296
effects	296
greeks	296
joined	296
player	296
hand	295
reign	295
arsenal	295
recently	295
settlement	295
places	295
cyprus	295
asian	295
older	295
account	294
navy	294
resistance	293
latter	293
critical	292
failed	292
elections	292
frequently	292
eight	292
completed	291
approach	291
regarding	291
existence	291
instruments	291
offered	291
controlled	290
christians	290
northwestern	290
2001	290
cross	290
complete	290
returned	289
featured	289
aid	289
want	289
yet	288
stage	288
impact	288
unit	288
route	287
gold	287
shown	287
reduce	287
clubs	287
secondary	286
practices	286
catalan	286
artist	286
travel	286
enlightenment	286
victory	285
byu	285
1980s	285
polish	285
appeared	284
stop	284
pressure	284
democratic	284
organizations	283
tucson	283
ibn	283
thousands	283
richard	283
efforts	283
ships	283
nigeria	282
staff	282
distinct	282
beyond	282
armed	282
marshall	282
sector	282
join	282
management	282
function	281
broadcast	281
intended	280
speech	280
spielberg	280
environment	280
greatest	279
supply	279
motor	279
vi	279
our	279
materials	279
charge	278
fourth	278
railway	278
christianity	278
1970s	277
headquarters	277
whole	277
chicago	277
shows	277
collection	276
1990s	276
secretary	276
article	276
temperatures	276
gained	276
identified	275
adult	275
courts	275
24	275
represent	275
carried	275
standards	275
quickly	275
migration	274
hot	274
50	274
apollo	274
issued	274
faith	274
combined	274
worked	273
colonies	273
cubs	273
chemical	273
southeast	273
protection	273
lands	272
heart	272
machine	271
olympic	271
agency	271
grew	271
defense	271
factors	271
permanent	270
match	270
robert	270
freedom	270
governments	270
reasons	270
composed	270
effective	269
portion	269
officers	269
decision	269
historic	269
irish	269
fbi	269
genes	269
components	269
quran	269
widespread	268
met	268
alaska	268
recognized	268
ways	268
defeat	268
formal	268
organisms	267
holy	267
accepted	267
cover	267
un	267
40	267
somali	267
establish	266
importance	266
ago	266
2002	266
lee	266
ice	266
louis	266
dog	266
taking	265
racial	265
convention	265
bbc	265
newspaper	265
regular	265
rates	265
developing	264
internal	264
qing	264
opposed	264
mandolin	264
philadelphia	264
element	264
17	263
tax	263
disc	263
medicine	263
david	263
resources	263
birth	262
write	262
neptune	262
represented	262
establishment	262
texts	262
consists	262
iron	262
expanded	262
think	261
traditionally	261
perform	261
literary	261
expected	260
sciences	259
nintendo	259
capacity	259
slaves	258
learning	258
necessary	258
ft	258
dance	257
alexander	257
degrees	257
agreed	257
kathmandu	257
occupied	257
increasingly	256
protect	256
channel	256
presidential	255
causes	255
australian	255
republican	255
popper	255
theatre	255
consider	255
stone	255
launch	254
remaining	254
story	254
cell	253
mosaic	253
fields	253
meant	253
1960s	253
target	253
speak	253
13	252
egyptian	252
swiss	252
letters	252
constructed	252
tower	252
removed	252
director	252
week	252
exchange	251
tour	251
lord	251
except	251
notably	251
advanced	250
dominant	250
factor	250
zone	250
male	250
mission	250
upper	250
engineering	249
enough	249
heat	249
bay	249
mayor	249
users	249
link	249
tribes	249
stores	249
academic	249
satellite	249
poor	249
planned	249
cathedral	249
recording	248
operate	248
colony	248
contrast	248
naval	248
patent	248
poland	248
workers	247
unique	247
raised	247
greatly	247
valencia	247
peninsula	247
minor	247
actually	246
protestant	246
lake	246
fleet	246
damage	246
bermuda	246
scientists	246
witnesses	245
length	245
albert	245
youtube	245
comics	245
flight	245
require	245
opposition	244
relay	244
formation	244
note	244
wanted	244
clothing	244
running	244
conference	243
owned	243
evolution	243
bridge	243
signal	243
21	243
build	243
phase	242
typical	242
testing	242
burma	242
communication	242
communist	242
korean	242
senate	242
captured	241
mixed	241
affected	241
commission	241
rail	241
closely	240
leave	240
analysis	240
fort	240
sanskrit	240
mark	240
understanding	240
institution	239
overall	239
fighting	239
titles	239
crime	239
allies	238
alternative	238
refers	238
keep	238
awards	238
initial	238
hospital	238
pass	238
sought	237
anthropology	237
tree	237
-	237
ibm	237
influential	237
structures	237
tried	236
czech	236
playing	236
plans	236
meeting	236
9	236
risk	236
classified	236
characteristics	236
suggested	235
press	235
politics	235
course	235
romans	235
liberal	234
allowing	234
comcast	234
regarded	234
awarded	234
tv	234
refused	234
fought	234
theories	233
scale	233
housing	233
simple	232
turned	232
corruption	232
unlike	232
christ	232
19	231
administrative	231
provinces	231
giving	231
creating	231
component	231
applications	231
ac	231
maintain	230
completely	230
showed	230
hill	230
price	230
agriculture	230
achieved	230
read	230
meet	229
environmental	229
estonian	229
prussian	229
points	229
seasons	229
frequency	229
behavior	229
muslims	229
technical	229
organized	229
weapons	229
attempted	229
positive	228
affairs	228
comes	228
academy	228
traffic	228
situation	228
towns	227
follow	227
movements	227
historians	227
principle	227
continental	227
decades	227
extended	226
entertainment	226
nine	226
leadership	226
toward	226
cut	226
allied	226
probably	225
policies	225
helena	225
runs	225
cold	225
emerged	225
significantly	225
orientation	225
respectively	225
gothic	225
gdp	225
constitutional	225
libya	225
effort	225
belong	224
entered	224
acts	224
earthquake	224
belief	224
kept	224
roughly	224
application	224
instance	224
simply	223
know	223
austria	223
love	223
transfer	223
blood	223
intelligence	222
listed	222
treatment	222
presbyterian	222
sell	222
colonial	222
heritage	222
transport	222
clear	222
gene	221
rejected	221
drug	221
translation	221
slavic	221
traditions	220
1990	220
connected	220
settled	220
banks	220
employed	220
sign	220
biggest	219
ordered	219
alliance	219
microsoft	219
author	219
attention	219
desert	219
mm	219
computers	218
byzantine	218
philip	218
namibia	218
temple	218
values	218
ancestry	217
23	217
dominated	217
virginia	217
drive	217
architectural	217
california	216
review	216
subsequent	216
bce	216
ship	216
invented	216
split	216
st	216
difference	215
negative	215
brazil	215
sony	215
classes	215
novel	215
equipment	215
ultimately	215
maximum	214
crown	214
image	214
wall	214
carry	214
formerly	214
contributed	214
norfolk	214
colleges	214
evolved	213
islam	213
distribution	213
authorities	213
reserve	213
mediterranean	213
inside	213
online	213
heavily	213
arabic	213
publication	213
corporation	213
lighting	212
revenue	212
attacked	212
santa	212
weather	212
opening	212
sites	212
reform	212
scotland	212
electrical	211
wave	211
teaching	211
russians	211
fell	211
carnival	211
turkey	211
surrounding	210
equal	210
spring	210
viewed	210
master	210
properties	210
speakers	210
bird	210
debate	210
germans	210
achieve	210
holds	210
shell	209
script	209
strategy	209
benefit	209
c.	209
weeks	209
determined	209
charleston	209
genome	208
doing	208
room	208
feet	208
claims	208
genocide	208
maintained	208
acquired	208
selection	208
turkish	208
cable	208
covered	208
advantage	208
fight	208
iranian	208
reforms	207
avoid	207
immigrants	207
reference	207
1991	207
visited	207
peak	207
determine	207
objects	207
edward	207
extensive	206
generation	206
educational	206
dst	206
object	205
fully	205
existing	205
silver	205
subsequently	205
rapid	205
leaving	204
newly	204
jehovah	204
versions	204
samurai	204
trading	204
taught	204
incorporated	203
suffered	203
grow	203
cork	203
joint	203
occurs	203
doctrine	203
actions	203
1989	203
continent	203
vacuum	203
persian	203
commonwealth	203
console	203
buddhist	203
star	203
antarctica	202
500	202
elevator	202
shared	202
popularity	202
limit	202
b	202
question	202
car	202
conducted	202
failure	201
functions	201
assent	201
care	201
transition	200
prize	200
bands	200
strength	200
offices	200
manufacturing	200
appearance	200
whereas	200
woman	200
relative	200
closed	200
d.	200
presented	200
approved	200
essential	200
floor	199
relationships	199
historically	199
extent	199
moving	199
takes	199
inspired	199
output	199
ashkenazi	199
ruler	198
sir	198
storage	198
penalty	198
techniques	198
critics	198
bring	198
converted	198
views	198
abbey	197
powerful	197
dedicated	197
200	197
lives	197
paid	197
proper	197
post	197
kings	197
inhabitants	196
cardinal	196
officer	196
happens	196
conservative	196
depending	196
distinction	196
going	196
feynman	196
threat	195
providing	195
alps	195
constant	195
rural	195
representatives	194
improved	194
myanmar	194
bible	194
28	194
guam	194
pop	194
declined	194
treaties	194
classification	194
gradually	194
chosen	193
credit	193
studio	193
diverse	193
operated	193
safety	193
career	193
nickname	193
goods	192
labor	192
industries	192
subjects	192
investment	192
concerns	192
digimon	192
principles	192
kingdoms	192
tend	191
22	191
marine	191
armies	191
external	191
density	191
writers	190
serves	190
fifth	190
copyright	190
contact	190
coastal	190
transportation	190
carbon	190
label	190
contained	189
bush	189
electricity	188
accused	188
26	188
16th	188
17th	188
1997	188
kill	188
specifically	188
facilities	188
describes	188
1950s	187
voltage	187
core	187
aspects	187
montana	187
zealand	187
spent	186
break	186
parents	186
studied	186
legislation	186
marriage	186
muhammad	186
focused	186
mexican	186
document	186
gods	186
tourism	186
arms	186
biological	186
homes	185
pattern	185
affect	185
transmission	185
sport	185
texas	185
serious	185
charter	184
renaissance	184
resolution	184
jobs	184
experienced	184
favor	184
projects	184
figures	183
sort	183
face	183
attempts	183
diversity	183
israeli	183
contract	183
criticized	183
happen	183
60	183
rapidly	183
improve	182
flag	182
arrived	182
societies	182
lose	182
originated	182
introduction	182
promoted	182
styles	182
rose	182
slave	182
married	182
pakistan	182
ratio	182
enter	181
agencies	181
pub	181
e.g	181
genre	181
districts	181
raleigh	181
instrument	181
compression	181
theater	181
chain	180
renamed	180
feel	180
dead	180
dropped	180
lowest	180
reports	180
agricultural	179
buddha	179
models	179
usage	179
championship	179
address	179
galicia	179
figure	179
xbox	179
mac	179
90	179
revolutionary	179
intellectual	179
my	179
measure	178
prices	178
insect	178
streets	178
broke	178
31	178
colors	178
periods	178
discovery	178
aspect	178
legislative	178
calendar	178
audience	178
brother	177
netherlands	177
attend	177
positions	177
wife	177
leds	177
asked	177
adolescents	177
1998	177
princess	177
height	177
wear	177
send	177
extremely	177
managed	177
classic	177
processes	177
mosaics	177
actual	176
playstation	176
pubs	176
80	176
communications	176
ministry	176
opera	176
joseph	176
golden	176
executed	176
mentioned	176
demand	176
normal	175
existed	175
vast	175
copies	175
electronic	175
display	175
combat	175
immediately	175
marvel	175
something	174
snow	174
edition	174
origins	174
markets	174
physics	174
patterns	174
360	174
equivalent	174
suggest	174
variation	174
rivers	173
1999	173
employees	173
races	173
supporters	173
wrestling	173
annually	173
score	173
connection	173
avicenna	173
27	173
criticism	173
guns	172
plays	172
ring	172
carriers	172
super	172
continues	172
athanasius	172
r.	172
concerned	172
losses	172
documents	172
conquered	172
declaration	172
justice	172
indicate	171
antibiotics	171
try	171
iraq	171
strongly	171
separated	171
me	171
coup	171
track	171
dates	171
founding	171
everton	171
entirely	171
shift	171
nearby	170
occupation	170
formally	170
round	170
researchers	170
felt	170
perhaps	170
hundred	170
hellenistic	170
1970	170
baptist	170
web	170
limits	170
drugs	169
circuit	169
poetry	169
matches	169
trying	169
winning	169
measures	169
concert	169
km2	169
sichuan	169
requires	168
visible	168
motors	168
borders	168
corps	168
orders	168
proved	168
invaded	168
funding	168
frederick	168
emotion	168
montevideo	168
eu	168
ann	168
separation	168
albums	168
cbc	168
membership	167
funds	167
los	167
duke	167
michael	167
1994	167
choice	167
bus	167
revealed	167
nobility	167
gives	167
celebrated	167
cardinals	167
budget	167
offers	167
bombing	167
technologies	167
deep	166
males	166
consumption	166
settlers	166
train	166
manhattan	166
commander	166
judges	166
directed	165
friends	165
causing	165
expressed	165
user	165
monarch	165
shape	165
1992	165
beliefs	165
attended	165
rare	165
prey	165
index	165
ruling	165
producing	165
universe	165
expensive	165
capable	165
serving	165
purposes	165
organism	164
village	164
professor	164
walls	164
scene	164
e.g.	164
sex	164
strategic	164
hosted	164
apart	164
effectively	164
double	164
mount	164
identify	164
successfully	163
peter	163
1930s	163
divine	163
emotions	163
afl	163
reading	163
judge	163
regime	163
hotel	163
alone	163
protected	163
sequence	162
coming	162
ones	162
divisions	162
reaction	162
fa	162
severe	162
debt	162
americas	161
compounds	161
exposure	161
quantum	161
northwest	161
observed	161
somalia	161
arena	161
look	161
characterized	161
post-punk	160
roots	160
1996	160
saying	160
religions	160
overseas	160
regulations	160
update	160
purchase	160
reality	160
accounts	159
categories	159
columbia	159
planning	159
file	159
useful	159
exception	159
1988	159
needs	158
relation	158
accept	158
weight	158
ports	158
normally	158
brown	158
persons	158
precipitation	158
goals	158
motion	157
hundreds	157
parks	157
quarter	157
ussr	157
combination	157
capture	157
decisions	157
spectre	157
historian	157
linked	157
perceived	156
germanic	156
lodge	156
macintosh	156
parallel	156
argue	156
volume	156
coalition	156
recordings	156
radiation	156
1995	156
trees	156
notes	155
efficiency	155
here	155
thing	155
facility	155
entity	155
bond	155
secular	155
visitors	155
—	155
v	155
centers	155
vietnam	155
massive	154
easily	154
replace	154
boys	154
bodies	154
expand	154
alcohol	154
secret	153
basketball	153
similarly	153
speaking	153
seats	153
mind	153
items	153
attributed	153
promote	153
website	153
landing	153
page	152
hosts	152
affirmative	152
concluded	152
interpretation	152
mammals	152
producer	152
1940	152
agree	152
bought	152
dry	152
setting	152
v.	152
trial	152
operates	152
category	151
borough	151
j.	151
possibly	151
manager	151
statement	151
lies	151
grant	151
wales	151
appears	151
theme	151
bern	151
yellow	151
canal	151
consist	151
voted	151
europeans	150
syria	150
el	150
job	150
considerable	150
household	150
neighborhood	150
demonstrated	150
sounds	150
rainfall	150
distance	149
residential	149
wind	149
suggests	149
dollar	149
forest	149
puerto	149
bishop	149
eritrea	149
ranking	149
coverage	149
alongside	149
3rd	149
changing	149
mechanical	149
database	149
1950	148
arbor	148
1980	148
selected	148
sides	148
cd	148
laid	148
otherwise	148
vary	148
hong	148
mechanism	147
ministers	147
encouraged	147
wealth	147
fundamental	147
yugoslavia	147
collapse	147
credited	147
stored	147
conquest	147
founder	147
assistance	147
protests	147
pact	147
!	147
memorial	146
costs	146
slavery	146
advance	146
constantinople	146
philosophical	146
passengers	146
democracy	146
diseases	146
preferred	146
rebellion	145
13th	145
del	145
becomes	145
respect	145
abandoned	145
sixth	145
characteristic	145
principal	145
nor	145
votes	145
destruction	145
ending	145
berlin	145
purchased	145
carrier	145
additionally	145
harbor	144
context	144
capacitors	144
businesses	144
onto	144
branches	144
your	144
consumer	144
ps3	144
spoke	144
begun	143
festivals	143
assumed	143
12th	143
represents	143
comprehensive	143
bureau	143
worth	143
substantial	143
extreme	143
recognition	143
succeeded	143
controversy	143
1945	143
mp3	143
dark	143
piece	142
wild	142
responsibility	142
rulers	142
candidates	142
phrase	142
thuringia	142
practical	142
folk	142
asthma	142
receiving	142
unicode	142
hub	142
someone	141
twice	141
1939	141
exists	141
signals	141
pure	141
add	141
broad	141
1979	141
hands	141
sister	141
graduate	141
pesticides	141
forming	141
interests	141
grounds	141
designated	141
fans	141
grown	141
leads	141
minimum	141
locations	140
contestants	140
punjab	140
judicial	140
residence	140
garden	140
virgil	140
dominican	140
canon	140
estimates	140
flow	140
installed	140
concern	140
retained	140
sovereign	140
translated	140
opinion	140
70	140
elevators	139
enemy	139
mobile	139
federation	139
slavs	139
solution	139
interior	139
reduction	139
hanover	139
pc	139
daylight	139
ban	139
asphalt	139
survey	139
printed	139
throne	139
writes	139
influences	139
stay	138
seems	138
comparison	138
minutes	138
discs	138
tons	138
tuberculosis	138
occasionally	138
drop	138
somerset	138
hindu	138
29	138
understand	138
2nd	137
matters	137
ranges	137
beijing	137
broadcasting	137
telephone	137
etc	137
candidate	137
rus	137
slightly	137
pieces	137
metro	137
ran	137
generated	137
experiences	137
technique	137
philosopher	137
programming	137
longest	137
emphasis	137
eton	137
benefits	137
soft	136
says	136
predators	136
sections	136
restricted	136
ensure	136
honor	136
champions	136
dc	136
strasbourg	136
mathematics	136
decrease	136
hardware	136
nevertheless	136
protein	136
successor	136
congo	136
n	136
forward	136
ceremony	136
violence	136
progress	135
immigration	135
virgin	135
t	135
eggs	135
winner	135
fund	135
outer	135
picture	135
terminal	135
gulf	135
renewable	135
fashion	135
soul	135
gender	134
containing	134
pictures	134
scheme	134
so-called	134
rich	134
integrated	134
execution	134
cycle	134
conduct	134
nes	134
capacitor	134
zhejiang	134
warsaw	134
1993	134
mainstream	134
conception	134
infrastructure	134
fish	134
increases	134
mercury	133
am	133
senior	133
adopt	133
jerusalem	133
kilometres	133
meat	133
obtain	133
austrian	133
usa	133
judaism	133
measured	133
2016	133
produces	133
extinction	133
proportion	133
northeast	133
lay	133
descent	132
unable	132
requirements	132
discrimination	132
monarchy	132
fuel	132
exhibition	132
brothers	132
et	132
thousand	132
kong	132
voice	132
cm	132
networks	132
sunday	132
visual	132
tom	131
1941	131
incident	131
personnel	131
5th	131
selling	131
commerce	131
governed	131
1986	131
radical	131
van	131
transferred	131
apply	131
supporting	131
obtained	131
legislature	131
condition	131
performing	131
restaurants	131
300	131
processing	130
emotional	130
geographical	130
approval	130
daughter	130
faced	130
amendment	130
households	130
writer	130
symbol	130
neighborhoods	130
express	130
chairman	130
rival	130
highway	130
protest	130
infantry	129
martin	129
fine	129
johnson	129
roads	129
tourists	129
utrecht	129
southwest	129
wider	129
got	129
westminster	129
shot	129
interstate	129
roles	129
tb	129
olympics	129
1949	129
initiated	128
recommended	128
courses	128
spirit	128
fixed	128
define	128
representative	128
1987	128
medium	128
skin	128
step	128
targets	128
bacterial	128
francis	128
fair	128
seat	128
covers	128
freemasonry	128
path	128
challenge	127
videos	127
1st	127
standing	127
offering	127
authors	127
remove	127
bishops	127
files	127
retail	127
14th	127
aim	127
choose	127
conversion	127
diplomatic	127
promotion	127
accompanied	127
15th	127
invention	127
civilization	126
1976	126
composition	126
spend	126
noble	126
ideal	126
vehicles	126
sq	126
proposal	126
implemented	126
connect	126
aside	126
concepts	126
sets	126
bitumen	126
lamps	126
transit	126
table	126
cubism	126
cabinet	126
siege	126
involving	126
self	125
manchester	125
al	125
singer	125
1967	125
stock	125
told	125
conservation	125
bit	125
committed	125
clock	125
jurisdiction	125
passage	125
begins	125
infrared	125
shortly	125
save	125
assets	125
rooms	125
artillery	125
restored	125
rain	125
perception	125
variations	124
rising	124
flying	124
philippines	124
wildlife	124
questions	124
swaziland	124
quite	124
rarely	124
newspapers	124
calls	124
images	124
damaged	124
angeles	124
1974	124
consisting	124
parliamentary	124
developments	124
scottish	124
monica	124
ball	124
counties	123
21st	123
females	123
huge	123
assigned	123
6th	123
shopping	123
cappella	123
settlements	123
aristotle	123
billboard	123
routes	123
easy	123
thermal	123
reducing	123
referendum	122
survived	122
frame	122
tracks	122
yuan	122
drinking	122
castle	122
violent	122
concentration	122
finished	122
background	122
diet	122
iv	122
guard	122
musicians	122
moon	122
explain	122
usaf	122
somewhat	122
manufacturers	122
steel	122
rpm	122
representation	121
learn	121
buy	121
soviets	121
boundaries	121
regard	121
economics	121
architects	121
involves	121
crops	121
expression	121
amounts	121
planet	121
vice	121
incandescent	121
casualties	121
temporary	121
taiwan	121
employment	121
furthermore	121
mainland	121
waves	121
twilight	121
count	120
threatened	120
distinguished	120
farmers	120
girls	120
filament	120
autonomy	120
1985	120
request	120
varieties	120
ethnicity	120
whites	120
inches	120
4th	120
45	120
balance	119
cuisine	119
tajikistan	119
1984	119
khan	119
adults	119
deaths	119
r	119
surrender	119
dated	119
merged	119
kansas	119
inner	119
ordinary	119
theology	119
studios	119
nationality	119
concentrated	119
amongst	119
rely	119
adolescence	119
supposed	119
compete	119
neither	119
stalin	118
reformed	118
customers	118
layer	118
coins	118
driven	118
ali	118
socialist	118
wine	118
11th	118
invade	118
decide	118
1975	118
establishing	118
banned	118
connections	118
acid	118
sovereignty	118
thinking	118
evolutionary	118
revival	118
platform	118
conflicts	118
vinyl	118
recognize	118
geographic	117
lamp	117
nepal	117
hour	117
blacks	117
ku	117
designs	117
speaker	117
populous	117
passenger	117
stories	117
participate	117
controversial	117
humanism	117
losing	117
writings	117
currency	117
seek	117
frédéric	117
destroy	117
contributions	117
holding	117
michigan	116
varies	116
nothing	116
marks	116
dependent	116
i.e	116
10,000	116
bulb	116
endangered	116
struggle	116
fox	116
strike	116
massachusetts	116
displayed	116
suburbs	116
secure	116
dating	116
bomb	116
1960	116
trend	116
teachings	116
opportunity	116
battles	115
oxygen	115
investigation	115
box	115
efficient	115
situated	115
partly	115
restrictions	115
featuring	115
1969	115
shipping	115
1982	115
lodges	115
reflected	115
criminal	115
movies	115
comic	115
gun	115
molecular	115
plain	115
alpine	114
hills	114
voting	114
stating	114
airports	114
depression	114
lot	114
1914	114
alexandria	114
camp	114
elite	114
hebrew	114
debut	114
differ	114
illegal	114
philosophers	114
luftwaffe	114
journal	114
concerning	114
sand	114
1978	114
treated	114
exclusive	114
worship	114
nobel	114
eye	114
elevation	114
underground	114
patients	113
unity	113
confirmed	113
governing	113
organic	113
35	113
tourist	113
task	113
search	113
appeal	113
atomic	113
norman	113
i.e.	113
vienna	113
sale	113
follows	113
palermo	113
armenians	113
controls	113
regards	113
scheduled	113
lights	113
block	113
architect	113
broken	113
hence	113
bringing	113
e	113
kinds	113
taxes	113
artistic	112
discussed	112
chart	112
autonomous	112
present-day	112
editor	112
bombers	112
soil	112
originate	112
machines	112
dollars	112
cult	112
orchestra	112
suffering	112
denominations	112
1948	112
mathematical	112
prisoners	112
150	112
tribe	112
spending	112
nazi	112
revolt	112
regularly	112
draw	112
captain	112
guinea-bissau	112
manner	112
voters	112
infection	112
aimed	111
merely	111
afghanistan	111
descendants	111
absolute	111
spectrum	111
liberty	111
stages	111
watch	111
medal	111
performances	111
net	111
nato	111
1920s	111
crimes	111
exercise	111
abolished	111
fifa	111
worst	111
discipline	111
distributed	110
plains	110
details	110
profession	110
encoding	110
headed	110
sphere	110
buried	110
ranks	110
loans	110
survive	110
publishing	110
jersey	110
x	110
denied	110
argument	110
interface	110
isolated	110
8th	110
lasted	110
goes	110
killing	110
settle	110
continuous	110
varied	109
faculty	109
institutes	109
1977	109
immediate	109
bad	109
missile	109
technological	109
annexed	109
le	109
poverty	109
defend	109
tools	109
laserdisc	109
100,000	109
substance	109
reformation	109
extend	109
funeral	109
400	109
youth	109
engaged	109
vision	109
partner	109
solid	109
learned	109
frequent	109
participated	109
wrestler	108
ties	108
capita	108
opponents	108
varying	108
c	108
habitat	108
opposite	108
fast	108
arrival	108
closer	108
arrested	108
arrive	108
chihuahua	108
worn	108
enforcement	108
expedition	108
competitions	108
municipal	108
jazz	108
des	108
georgia	108
publish	108
customs	108
exposed	108
stable	108
fewer	108
arose	107
1968	107
reputation	107
baseball	107
samoa	107
reflect	107
decreased	107
paintings	107
virtually	107
s	107
antennas	107
charged	107
cars	107
stopped	107
entities	107
prevented	107
caesar	107
g	107
consisted	107
eliminated	107
scenes	106
piano	106
depends	106
relief	106
heads	106
slow	106
operational	106
bronze	106
gray	106
alloys	106
gardens	106
leaves	106
waste	106
adjacent	106
emergency	106
succession	106
shares	106
alsace	106
independently	106
fame	106
montini	106
baltic	106
crew	105
lama	105
younger	105
superior	105
psychology	105
receives	105
cast	105
engine	105
initiative	105
civilians	105
compact	105
carrying	105
connecticut	105
dean	105
jackson	105
pitch	105
ge	105
breeding	105
necessarily	105
organisation	105
acres	105
missions	105
supplies	105
hope	105
mahayana	105
laboratory	104
printing	104
vocal	104
airlines	104
balkans	104
metals	104
1966	104
infringement	104
ranging	104
adolescent	104
mental	104
description	104
message	104
partially	104
partnership	104
undergraduate	104
chapter	104
prayer	104
1944	104
millennium	103
channels	103
nyc	103
neighboring	103
ce	103
attracted	103
1972	103
pollution	103
elsewhere	103
skills	103
gallery	103
connecting	103
hair	103
1971	103
cbs	103
apparent	103
hispanic	103
glaciers	103
campaigns	103
scientist	103
explained	103
encourage	102
1981	102
civilian	102
federalism	102
deposits	102
trained	102
pointed	102
spiritual	102
seem	102
1918	102
links	102
busiest	102
uefa	102
populated	102
orbit	102
magnetic	102
boy	102
smith	102
broadcasts	102
jefferson	102
studying	102
entry	101
logic	101
contribute	101
mode	101
chapel	101
warfare	101
earned	101
1973	101
reaching	101
rice	101
1,000	101
rajasthan	101
protestants	101
1964	101
truth	101
rebels	101
75	101
essentially	101
regulation	101
da	101
imposed	101
calling	101
protocol	101
hockey	101
eat	101
agreements	101
clause	101
frank	101
correct	101
tool	101
distinctive	101
bombs	100
arthur	100
railroad	100
traits	100
cavalry	100
surviving	100
obama	100
ukraine	100
jones	100
neolithic	100
analog	100
taylor	100
immune	100
francisco	100
literally	100
exclusively	100
isles	100
cited	100
frequencies	100
literacy	100
estimate	100
specialized	99
card	99
indicated	99
twelve	99
10th	99
adoption	99
weekly	99
1953	99
dielectric	99
strict	99
cognitive	99
presidency	99
vessels	99
offensive	99
crop	99
safe	99
perspective	99
ottomans	99
publicly	99
caribbean	99
publications	99
followers	99
invited	99
pair	99
cancer	99
32	99
antarctic	99
championships	99
pennsylvania	99
filed	99
fear	99
solo	99
centres	99
sacrifice	98
prevalent	98
signs	98
thereby	98
extinct	98
bowl	98
alloy	98
rating	98
65	98
rocket	98
monks	98
panel	98
permitted	98
discussion	98
singles	98
sicily	98
agent	98
edge	98
funded	98
modified	98
duties	98
introduce	98
78	98
resident	98
attached	98
mali	98
provincial	98
eyes	98
nationalist	98
m.	97
sumerian	97
keeping	97
archives	97
1983	97
announce	97
stress	97
linguistic	97
screen	97
metres	97
experimental	97
friend	97
valencian	97
absorbed	97
athletic	97
long-term	97
unemployment	97
foods	97
conventional	97
w.	97
trust	97
protesters	97
desire	97
reserves	97
dress	97
indeed	96
burmese	96
involvement	96
territorial	96
vehicle	96
extension	96
convert	96
7th	96
sentence	96
brief	96
papal	96
registered	96
departments	96
ownership	96
compare	96
glacier	96
grain	96
mid	96
forests	96
difficulty	96
mix	96
villages	96
cia	96
error	96
bases	96
enabled	96
1920	96
walter	96
scholar	96
identical	96
manufactured	96
tests	96
findings	96
surrounded	95
wii	95
slowly	95
moral	95
arabs	95
electronics	95
clearly	95
1955	95
plate	95
1962	95
disaster	95
continuing	95
detailed	95
sufficient	95
drawn	95
citizenship	95
engage	95
boat	95
passing	95
a.	95
mutual	95
artificial	95
suburban	95
internationally	95
acids	95
papers	95
wealthy	95
commissioned	95
diarrhea	95
madaris	95
victims	95
migrate	95
alphabet	95
pronunciation	95
narrow	95
2000s	95
wu	95
contestant	95
repeated	95
headquartered	95
negotiations	94
feed	94
millions	94
painting	94
charges	94
fresh	94
adding	94
symbols	94
accurate	94
vertical	94
educated	94
framework	94
1000	94
recognised	94
romantic	94
retain	94
experiments	94
bar	94
circumstances	94
possibility	94
maintaining	94
notion	94
associations	94
hdtv	94
adapted	94
layers	94
raids	94
hospitals	94
sultan	94
copy	94
composers	93
programme	93
annelids	93
deputy	93
agents	93
idealism	93
empires	93
map	93
nobles	93
attendance	93
unified	93
h.	93
molecules	93
atmosphere	93
1961	93
proclaimed	93
opportunities	93
sweden	93
consequence	93
newer	93
regardless	93
b.	93
stars	93
owner	93
dramatic	93
well-known	93
parent	93
sole	93
collected	93
enacted	93
turks	93
unfpa	93
trains	93
vocabulary	93
crossed	92
sharing	92
maria	92
enjoyed	92
contest	92
and/or	92
recovery	92
seeking	92
firm	92
oxide	92
museums	92
consecutive	92
segment	92
ancestors	92
engineers	92
sacred	92
innovation	92
rugby	92
attract	92
fail	92
towers	92
1958	92
scout	92
marry	92
beach	92
anthropologists	92
drew	92
explorer	92
mr.	91
estate	91
poultry	91
patents	91
expelled	91
municipalities	91
fly	91
jr.	91
beat	91
singing	91
ukrainian	91
catholics	91
meetings	91
finance	91
eighth	91
resigned	91
1956	91
sleep	91
broadway	91
meanwhile	91
liverpool	91
prepared	91
szlachta	91
farming	91
arizona	91
factories	90
claiming	90
competing	90
infectious	90
uniform	90
celebration	90
franklin	90
representing	90
hitler	90
responded	90
vatican	90
teach	90
weapon	90
objective	90
referring	90
raise	90
filled	90
coronation	90
anniversary	90
hits	90
impossible	90
rico	90
storm	90
reject	90
hungary	90
wire	90
kilometers	90
replacement	89
tied	89
centered	89
option	89
gross	89
cooperation	89
switch	89
stands	89
acceptance	89
moment	89
compound	89
releases	89
permit	89
possession	89
stability	89
os	89
painted	89
distinguish	89
hudson	89
marketing	89
minorities	89
ends	89
involve	89
inland	89
chance	89
owners	89
warm	89
none	89
pius	89
confederation	89
2010.	89
joining	88
finding	88
villa	88
affiliated	88
georgian	88
stronger	88
uprising	88
parade	88
transformed	88
tropical	88
nights	88
1936	88
plus	88
boundary	88
grid	88
polytechnic	88
experiment	88
revenues	88
faster	88
statistics	88
mongol	88
refugees	88
duty	88
snowfall	88
significance	88
du	88
mining	88
comprised	88
anything	88
emergence	88
priests	88
reverse	88
owns	88
acting	87
deployed	87
connects	87
mines	87
weak	87
indicates	87
baroque	87
respond	87
exact	87
neutral	87
purple	87
acquire	87
foot	87
actor	87
punishment	87
really	87
governance	87
appropriate	87
prompted	87
1912	87
meters	87
mechanics	87
commanded	87
saving	87
criteria	87
wrestlers	87
bear	87
ultimate	87
showing	87
bills	87
beings	87
hearing	87
psychological	87
interactions	87
improvements	87
merchants	87
particles	87
resource	87
wing	86
maintains	86
liquid	86
1952	86
powered	86
declare	86
d	86
childhood	86
understood	86
1963	86
kiev	86
horse	86
planes	86
fled	86
salt	86
suffer	86
administered	86
famicom	86
touch	86
belt	86
sons	86
kennedy	86
cds	86
denomination	86
ca	86
anglican	86
large-scale	86
codes	86
obligations	86
corporate	86
boroughs	86
ahead	86
ceo	85
fiber	85
aviation	85
plane	85
optical	85
pronounced	85
usual	85
consent	85
madrid	85
tensions	85
1965	85
row	85
croatian	85
doors	85
occupy	85
teachers	85
nicholas	85
realm	85
y	85
alumni	85
tcm	85
nigerian	85
ford	85
howard	85
closest	85
traced	85
statistical	85
rated	85
phenomenon	85
remote	85
belgium	85
biology	85
basin	85
segments	85
xxiii	85
umayyad	85
tell	85
pro	85
interested	85
modern-day	85
predominantly	85
preserved	85
lie	85
fishing	85
hollywood	85
ready	85
boom	85
expanding	84
ongoing	84
rescue	84
looking	84
manchu	84
breaking	84
license	84
readers	84
collapsed	84
escape	84
gorbachev	84
monetary	84
/	84
desktop	84
withdraw	84
falls	84
participation	84
riba	84
evening	84
relevant	84
dr.	84
winners	84
33	84
coined	84
variants	84
migrants	84
fc	84
defining	84
helps	84
williams	84
entering	84
implementation	84
indonesia	84
linear	84
buckingham	84
1900	84
congregations	83
divide	83
handle	83
dalai	83
singapore	83
1947	83
heresy	83
exports	83
1942	83
fossil	83
formats	83
rebel	83
oxford	83
temples	83
uruguay	83
simultaneously	83
1937	83
flat	83
zones	83
termed	83
romance	83
ratings	83
descended	83
instrumental	83
9th	83
absence	83
composer	83
intense	83
alfred	83
morning	83
median	83
1954	83
snes	83
battery	83
crossing	83
atticus	83
mixture	83
priest	83
sectors	83
russell	82
locke	82
mockingbird	82
chose	82
arm	82
trophy	82
capabilities	82
atoms	82
landmark	82
articles	82
argues	82
structural	82
banking	82
beautiful	82
mtv	82
1957	82
occurring	82
capability	82
ascii	82
plaza	82
tournament	82
circuits	82
draft	81
d.c.	81
legally	81
circadian	81
1910	81
corresponding	81
charity	81
militia	81
missionaries	81
translations	81
1930	81
consistent	81
occasions	81
collectively	81
heard	81
preserve	81
doctor	81
ancestor	81
pushed	81
tunnel	81
bottom	81
potentially	81
destination	81
lakes	81
globe	81
warner	81
strip	81
dangerous	81
communists	81
transistor	81
concerts	81
factory	81
displays	81
stops	80
fat	80
athens	80
communicate	80
electoral	80
integration	80
input	80
attraction	80
lesser	80
trace	80
blocks	80
advice	80
clan	80
shifted	80
hotels	80
lords	80
steps	80
shorter	80
lincoln	80
e.	80
thailand	80
juan	80
underlying	80
removal	80
consumers	80
eritrean	80
charts	80
depicted	80
1917	80
fill	80
sugar	80
fathers	80
practiced	80
chemistry	80
theoretical	80
heights	80
speeds	80
manufacture	80
housed	80
deemed	79
chamber	79
acknowledged	79
measurement	79
delayed	79
tribute	79
laser	79
o	79
prison	79
cypriot	79
1911	79
suspended	79
volumes	79
samuel	79
visiting	79
infections	79
withdrew	79
teacher	79
peasants	79
homosexual	79
easier	79
dissolved	79
1922	79
depend	79
productions	79
tall	79
f.	79
symphony	79
believes	79
returning	79
discuss	79
biblical	79
arrangement	79
electron	79
danger	78
adam	78
grammar	78
getting	78
macedonian	78
statute	78
somalis	78
navigation	78
hokkien	78
chemicals	78
h	78
grants	78
standardized	78
hunters	78
availability	78
1946	78
respective	78
generations	78
register	78
fortune	78
95	78
unless	78
grade	78
specified	78
subsidiary	78
definitions	78
functional	78
rhine	78
grapes	78
egyptians	78
hdi	78
let	78
franchise	78
appointment	78
libraries	78
mile	78
phonology	77
viewers	77
1931	77
gates	77
fighter	77
extra	77
hd	77
nationalism	77
declining	77
advances	77
roger	77
gay	77
profit	77
root	77
neighbouring	77
predator	77
latest	77
basilica	77
maritime	77
satellites	77
carl	77
sudan	77
transmitted	77
comedy	77
aa	77
ideology	77
cent	77
exceptions	77
subcontinent	77
dimensions	77
simplified	77
brigade	77
traders	77
suez	77
identification	77
lady	77
citing	76
raf	76
intervention	76
dvd	76
participants	76
deities	76
archive	76
abstract	76
rolling	76
competitive	76
facto	76
interaction	76
telecommunications	76
liberation	76
daniel	76
favour	76
authorized	76
bass	76
reconstruction	76
supports	76
madison	76
guide	76
sina	76
humanity	76
collective	76
persecution	76
detect	76
petroleum	76
bulbs	76
cypriots	76
coding	76
2008.	76
synthetic	76
shut	76
print	76
libyan	76
abroad	76
tribal	76
arrest	76
murder	76
aided	76
gospel	76
retreat	76
inhabited	76
accounted	75
prefer	75
export	75
dominance	75
employ	75
cape	75
apps	75
sahara	75
everything	75
tallest	75
julian	75
indies	75
coal	75
nbc	75
nutrients	75
vii	75
reporting	75
promised	75
treat	75
promoting	75
forbes	75
moreover	75
progressive	75
demographic	75
drives	75
bars	75
wings	75
excluded	75
roosevelt	75
partners	75
delivered	75
clocks	75
emperors	75
les	74
raw	74
considering	74
citizen	74
rotor	74
himachal	74
democrats	74
fired	74
facing	74
tested	74
disputed	74
transmitter	74
episode	74
observation	74
formula	74
oak	74
hurricane	74
duration	74
landed	74
exile	74
ritual	74
portions	74
ipods	74
eleven	74
